define(function(require){
    require('js/photoClip/jquery.photoClip_2M.js');
    var Kit = require('component/kit');
    var Bussiness = Kit.use('Bussiness');
    var Utility = require('common/utility');
    var Promise = Utility['Promise'];
    var stringFormat = Utility['String']['stringFormat'];
    var Bridge=Utility['Bridge'];

    var TEMPLATE={
            'Main':'<div class="wrap">\
                        <div class="block_tips hidden">\
                            <div class="info_tips">\
                                <span class="tips_detail"></span>\
                            </div>\
                        </div>\
                        <div class="Host_Rules_Details hidden">\
                            <span class="Rules_Details_Close">\
                                <a href="javascript:;"></a>\
                            </span>\
                            <div class="rules1">\
                                <h1 class="rules1_title">قواعد مسابقة نجوم الجامعات </h1>\
                                <span class="rules1_1">1- هذه المسابقة عبارة عن منافسة بين المتقدمين ، والمطلوب من جميع المتقدمين تقديم أفضل عرض بث مباشر على تطبيق 7 نجوم للعروض المباشرة في الشرق الأوسط .</span>\
                                <span class="rules1_2">2- في هذا المسابقة  يشترط أن يكون المتقدم من الدول العربية ، وأن يكون طالب جامعي سواء كان بكالوريوس أو ماجستير أو دكتوراة .</span>\
                                <span class="rules1_3">3- سيتم اختيار عدد من المتقدمين لإجراء مسابقة نجوم الجامعات ، علماً أن الأولوية هي لأصحاب المواهب مثل : الغناء ، الشعر ، الطرب ، الرقص وغيرها من المواهب .</span>\
                                <span class="rules1_4">4- فترة التسجيل : من يوم 1 إلى 20 شهر نوفمبر .</span>\
                                <span class="rules1_5">5- مسابقة نجوم الجامعات تنقسم إلى ثلاث جولات ، الجولة الأولى مكونة من 6 مجموعات ، وتبدأ الجولة الأولى من يوم 22 إلى يوم 28 شهر نوفمبر ، والفائزين الثلاثة من كل مجموعة سيتصدرون للجولة الثانية من المسابقة .</span>\
                                <span class="rules1_6">6- الجولة الثانية : تبدأ من يوم 1 إلى يوم 7 شهر ديسمبر ، الفائزين الـ 18 مستابق من الجولة الأولى ستقام مسابقة بينهم كالتالي : الـ 18 متسابق ينقسمون إلى 9 مجموعات ، كل مجموعة فيها مسابقة  بين شخصين ، والفائز من كل مجموعة سيكون متصدر إلى الجولة الثالثة .\
            <br />\
ملاحظة : توجد هناك فرصة أخيرة للمتسابقين الـ 9  الذين لم يحالفهم الحظ للصعود إلى الجولة الثالثة ، حيث سيتم إجراء مسابقة بينهم ، وسيتم اختيار شخصاً واحداً من بين الـ 9 المتسابقين ، وبهذا سيكون لدينا 10 من المتسابقين للجولة الثالثة .</span>\
                                <span class="rules1_7">7- الجولة الثالثة : تبدأ من يوم 11 إلى يوم 12 شهر ديسمبر ، والمسابقة ستكون بين الـ 10 الفائزين من الجولة الثانية ، المسابقة ستكون بين كل شخصين منهم ، والفائزين الـ 5 سيتم إجراء مسابقة كبرى بينهم وبين خمسة من مضيفي 7 نجوم ، والحاصلين على الـ 3  المراكز الأولى سيحصلون على جوائز قيمة .</span>\
                                <span class="rules1_8">8- جوائز المسابقة : الحاصل على المركز الأول سيحصل على 5000 دولار ، والحاصل على المركز الثاني سيحصل على 3000 دولار ، والحاصل على المركز الثالث سيحصل على 1000 دولار  ، بالإضافة إلى فرصة السفر إلى تركيا .</span>\
                                <span class="rules1_9">9- الرجاء الإلتزام بقواعد منصة 7 نجوم ، واحترام قوانين البلد وعدم الإخلال بأمن وسلامة البلد ، لمعرفة قائمة المخالفات يرجى النظر إلى المرفق .</span>\
                                <span class="rules1_10">10- الرجاء كتابة المعلومات الشخصية للمتقدمين بشكل صحيح ، مالم سيتم حرمانك من الأشتراك بالمسابقة ، وأيضاً لن تستطيع الحصول على أي جائزة قد تحصل عليها.</span>\
                                <span class="rules1_11">11- هذا النشاط تحت إشراف شركة 7 نجوم</span>\
                          </div>\
                          <div class="rules2">\
                                <h1 class="rules2_title"> قائمة بجميع المخالفات :</h1>\
                                <span class="rules2_1">1- يمنع تجاهل تعليمات ادمن الإدارة الموجهة للمضيف أثناء البث .</span>\
                                <span class="rules2_2">2- مرور خمس دقائق من البث ولم يكن المضيف موجود أو كانت الشاشة سوداء .</span>\
                                <span class="rules2_3">3- يمنع القيام بأي حركات أو أصوات بها إيحاءات جنسية أو تقديم أي مواد إباحية أثناء البث المباشر .</span>\
                                <span class="rules2_4">4- الإستلقاء على السرير أثناء البث المباشر .</span>\
                                <span class="rules2_5">5- يمنع تواجد شخص آخر نيابةً عن المضيف الأصلي .</span>\
                                <span class="rules2_6">6- إرتداء الملابس الغير لائقة مثل الملابس الشفافة أو القصيرة أو الملابس التي تكشف منطقة الصدر .</span>\
                                <span class="rules2_7">7- التدخين أثناء البث المباشر .</span>\
                                <span class="rules2_8">8- يمنع استعمال المضيف لفيديو مسجل أو وضع تسجيلات صوتية أو تثبيت صورة بهدف المراوغة واستهلاك الوقت دون تفاعل المضيف مع المستخدمين .</span>\
                                <span class="rules2_9">9- يمنع تبادل السب مع المستخدمين والمضيفين الآخرين أو التشهير والعنصرية ضد الآخرين .</span>\
                                <span class="rules2_10">10- نشر اشاعات لتشويه صورة الموقع .</span>\
                                <span class="rules2_11">11- الدعوة إلى التشجار بين المستخدمين .</span>\
                                <span class="rules2_12">12- الخوض في مواضيع لها علاقة بالسياسة أو الدين أو معارضة للقانون .</span>\
                                <span class="rules2_13">13- يمنع عرض إعلانات أو عمل دعاية لأي موقع تقدم محتوى مشابة للمحتوى المقدم من موقع 7 نجوم أو العمل لدى أي موقع مشابه .</span>\
                                <span class="rules2_14">14- عدم تناول أي أطعمة بشكل أو طريقة تثير اشمئزاز المستخدمين.</span>\
                                <span class="rules2_15">15- تقديم العروض الخطرة التي تهدد السلامة الشخصية أو العامة .</span>\
                                <span class="rules2_16"> 16- يمنع الترويج لتعاطي أي ممنوعات مثل المخدرات وغيرها .</span>\
                                <span class="rules2_17">17- يمنع التحريض على العنف أو الإرهاب أو ارتكاب الجرائم .</span>\
                                <span class="rules2_18">18- يمنع مخالفة المضيف لقوانيين الدولة التي يقدم البث من خلالها .</span>\
                          </div>\
                        </div>\
                        <div class="already_reg hidden">\
                            <div class="success_Tips">\
                                <span class="tips_details">تم التسجيل بنجاح ، حظاً موفقاً</span>\
                            </div>\
                            <span class="revise">تعديل</span>\
                        </div>\
                        <a class="page_back hidden" href="javascript:;"><span></span></a>\
                        <div class="success_Tips hidden">\
                            <span class="tips_details">تم التسجيل بنجاح ، حظاً موفقاً</span>\
                        </div>\
                        <div class="page_bannar"></div>\
                        <div class="Activity_Reg">\
                            <h2 class="Reg_Title"><a class="Host_Rules" href="javascript:;">تفاصيل النشاط</a></h2>\
                            <span class="Reg_Detail"></span>\
                            <div class="Register_Info">\
                                <span class="Name_User"><input id="user_name" maxlength="50" type="text" placeholder="الرجاء كتابة الإسم الحقيقي"/></span>\
                                <div class="Sex_User">\
                                    <span class="Male">\
                                        <input name="Sex_User"  id="Male" type="radio" value="1" />ذكر\
                                    </span>\
                                    <span class="Female">\
                                        <input name="Sex_User" id="Female" type="radio" value="2"/>أنثى\
                                    </span>\
                                </div>\
                                <div class="Country">\
                                    <input id="Select_Country" type="text" placeholder="قم باختيار الجنسية" readonly />\
                                    <div id="Country_All" class="hidden">\
                                        <span class="country_back">\
                                        <a href="javascript:;" class="back_btn">رجوع</a>اختيار الدولة\
                                        </span>\
                                        <div id="Country_List" class=""></div>\
                                    </div>\
                                </div>\
                                <div class="City">\
                                    <input id="Select_City" type="text" placeholder="محل الإقامة" readonly />\
                                    <div id="Citys_All" class="hidden">\
                                        <span class="city_back">\
                                            <a class="back_btn" href="javascript:;">رجوع</a>محل الإقامة\
                                        </span>\
                                        <div id="City_List"></div>\
                                    </div>\
                                </div>\
                                <div class="School">\
                                    <input id="Select_Schoole" type="text" placeholder="اختار الجامعة" readonly />\
                                    <div id="School_All" class="hidden">\
                                        <span class="school_back">\
                                            <a class="back_btn" href="javascript:;">رجوع</a>محل الإقامة\
                                        </span>\
                                        <div id="School_List"></div>\
                                    </div>\
                                </div>\
                                <div class="Whatsapp">\
                                    <input class="country_num" type="number" value="" /><!--\
                                    --><input class="whatsapp_num" type="text" placeholder="قم بإدخال رقم الواتس اب" />\
                                </div>\
                                <div class="FaceBook">\
                                    <input id="FaceBook" type="text" placeholder="الرجاء قم بإدخال رابط صفحتك الشخصية على الفيسبوك" value="" />\
                                </div>\
                                <div class="Favorite">\
                                    <h2 class="favorite_tip">المواهب :</h2>\
    <h3 class="Upload_Photo_Tips"> الرجاء قم بإختيار ثلاث مواهب فقط</h3>\
                                    <span id="Singing" class="Interest1">غناء</span>\
                                    <span id="Dance" class="Interest2">عازف موسيقى</span>\
                                    <span id="Acting" class="Interest3">تمثيل</span>\
                                    <span id="Other" class="Interest4">أخرى </span>\
                                </div>\
                                <div class="screen_blank">\
                                    <div class="Screen_Photo">\
                                        <div id="clipArea"></div>\
                                        <span class="btn_screen">\
                                            <a id="clipBtn" href="javascript:;">تأكيد</a>\
                                        </span>\
                                    </div>\
                                </div>\
                                <div class="Upload_Photo">\
                                    <div class="divs">\
                                        <input type="file" id="file1" accept="image/*">\
                                        <img id="view1" class="view" src=""/>\
                                    </div>\
                                    <div class="divs">\
                                        <input type="file" id="file2" accept="image/*">\
                                        <img id="view2" class="view" src=""/>\
                                    </div>\
                                </div>\
                                <span class="Required_Tips">هذا النشاط خاص بالطلاب الجامعيين ، لذلك إذا لم تقم بتحميل صورة البطاقة الجامعية ، فسيتم حذف طلبك . </span>\
                                <a class="Submit_Info" href="javascript:;"><span>تقديم </span></a>\
<span class="Host_Rule_info">الضغط على زر " تقديم  " يعني أنك وافقت على<a class="Host_Rules" href="javascript:;"> جميع الشروط الخاصة بالمضيفين</a></span>\
                            </div>\
                             <div class="Sub_Tips">\
                                <h2 class="Tips_title">تنبيه ! </h2>\
                                <span class="Tips_Desc">تأكد من صحة بياناتك قبل التقديم\
                        فإذا قمت بإرسالها فلن تستطيع التعديل بعد ذلك ! </span>\
                                <div class="Sub_Btn">\
                                <a class="Edit" href="javascript:;"><span>تعديل </span></a>\
                                <a class="Confirm" href="javascript:;"><span>تأكيد </span></a>\
                                </div>\
                            </div>\
                        </div>\
                    </div>'
        };

    var Page= {
        'run': function () {
            this.render();
            this.bind();
            this.uploadImg();
            this.doJoin();
        },
        'render': function () {
            console.log(window.localStorage)
            this.container = $('#container');
            this.sMain =stringFormat(TEMPLATE.Main);
            this.container.html( this.sMain );
        },
        'bind':function(){
            //jQuery.noConflict();
            var BannarHeight=jQuery(".page_bannar").height(),
                UserListHeight=jQuery(".User_List").height(),
                LocalStroge,
                Whatsapp,
                Country_City,
                Country_City_School,
                Get_Stroge,
                Set_Stroge;

            Country_City_School=[
                {
                    'name':'Egypt',
                    'country':'مصر',
                    'id':20,
                    'citys':['القاهرة','الاسكندرية','اسوان','بور سعيد','شرم الشيخ','سوهاج','الأقصر','المنصورة','العجمي','السويس','بني سويف','سمالوط','المنيا','ملوي','أسيوط','سوهاج','حرجا','قنا','اسيا','ادفو','ابو سميل ','الفرافة','أبومنقار','الواحات الداخلة','الخارجة','باريس','موط','الغردفة','سفاجا','القصير','مرسي علم','برنس'],
                    'school':['جامعة الأزهر','جامعة الا سكندرية','جامعة أسوان','جامعة  أسيوط','جامعة بنها','جامعة بني سويف','جامعة  بورسعيد','جامعة جنوب الودي','جامعة حلوان','جامعة دمنهور','جامعة دمياط','جامعة الزقازيق','جامعة سوهاج','جامعة السويس','جامعة طنطا','جامعة العريش','جامعة عين شمس','جامعة القيوم','جامعة القاهرة','جامعة قناة السويس','جامعة كفر الشيخ','جامعة مدينة السادات','جامعة المنصورة','جامعة المنوفية','جامعة المنيا','الجامعة المصرية اليابانية للعلوم والتكنولوجيا','الجامعة العمالية','أكاديمية الفنون','أكاديمية السادات للعلوم الادارية','جامعة النيل','جامعة العلوم والتكنولوجيا','الجامعة المصرية للتعلم الالكتروني','الجامعة الفرنسية في مصر','أكاديمية  طيبة المتكاملة للعلوم','الجامعة الأمريكية بالقاهرة','الجامعة البريطاية في مصر','الجامعة الألمانية بالقاهرة','الجامعة المصرية الروسية','جامعة المستقبل بمصر','جامعة هليوبوليس للتنمية المستدامة','جامعة مصر الدولية','الجامعة الحديثة للتكنولوجيا والمعلومات','جامعة بدر بالقاهرة','الجامعة العربية المفتوحة','الأكاديمية الحديثة في المعادي','أكاديمية الشروق','جامعة 6 أكتوبر','جامعة الأهرام الكندية','جامعة أكتوبر للعلوم الحديثة والآداب','جامعة مصر للعلوم والتكنولوجيا','أكاديمية أخبار اليوم','الأكاديمية الدولية للهندسة وعلوم الاعلام','الكلية الكندية الدولية','جامعة فاروس','جامعة  سنجور','الأكاديمية العربية للعلوم والتكنولوجيا والنقل البحر','المعاهد العليا بكينج مريوط','معاهد العبور','جامعة الدلتا للعلوم والتكنولوجيا','أكاديمية النيل للعلوم','جامعة العاشر من رمضان','جامعة النهضة','جامعة دراية','جامعة سيناء','جامعة برلين التقنية','جامعة الاسكندرية الدولية في البصرة','الجامعة المصرية للثقافة الاسلامية','جامعة بيروت العربية']
                },{
                    'name':'Morocco',
                    'country':'المغرب',
                    'id':212,
                    'citys':['طرفاية','أخفنير','ابطيح','بن خليل','الوطية','طانطان','تلمزون','لمسيد','أسا','تيفمرت','كلميم','سيدي ابفني','ميرلفت','نزنيت','تافراوت','اغرم','طاطا','أيت ملول','أكادير','تارودانت','الصويرة','سيساوة','مركش','اسني','تالوين','تازناخت','ورزازات','أسفي','اليوسفية','الشماعية','بن جرير','أزلال','دمنات','سطات ','برشيد',' الدار البيضاء','خريبكة','وادزم','الفقيه بن صالح','بني ملال','الصخيرات ','الرباط','القنيطرة','الخميسات ','مكناس','سيدي سليمان','أزرو','ميدلت','فاس','صفرو','القصر الكبير','وزان','العرائش','أصيلة','طنجة','تطوان','الحسيمة','ميضار','تازة','الناظور','بركان ','جرادة','وجدة'],
                    'school':['جامعة عبد المالك السعدي','جامعة الأخوين','جامعة القاضي عياض','جامعة شعيب الدكالي','جامعة محمد الأول','جامعة محمد الخامس','جامعة محمد الخامس أكدال','جامعة محمد الخامس السويسي','جامعة سيدي محمد بن عبد الله','جامعة القاضي عياض','جامعة القرويين','جامعة الحسن الثاني بالدار البيضاء']
                },{
                    'name':'Tunisia',
                    'country':'تونس',
                    'id':216,
                    'citys':['تونس','بنزرت','الجمامات','الكاف','سوسة','القيروان','المنستير','القصرين','سيدي  بوزبد','صفاقس','قفصة','نوزر','فابس','حومة السوف','فابس','دوز','جرجيس','مدنين','نطاوين','أبو كماش'],
                    'school':['جامعة تونس','جامعة تونس المنار','جامعة قرطاج','جامعة الزيتونة','جامعة منوبة','جامعة جندوبة','جامعة سوسة','جامعة المنستير','جامعة القيروان','جامعة قفصة','جامعة صفاقس','جامعة قابس','جامعة تونس الافتراضية','المعاهد العليا للدراسات التكنولوجية','الجامعة الخاصة للتعليم العالي الامل','الجامعة الخاصة للتكنولوجيا','الجامعة الخاصة للقنون والتصميم','الجامعة الخاصة للعلوم والفنون التقنيات في تونس','الجامعة المتوسطية للأعمال','جامعة ابن خلدون الخاصة','الجامعة الخاصة محمد الماطري','جامعة تونس قرطاج الخاصة','مدرسة البوليتنيك الخاصة','المدرسة العليا الخاصة للمهندسين بسوسة','المدرسة العليا الخاصة للتكنولوجيا والعملومات والادارة بسوسة','المعهد الخاص للدراسات العليا  في سوسة','المعهد العالي الخاص لعلوم التمريض بسوسة','الجامعة الخاصة بسوسة','كلية الدراسات العليا للدراسات الادارية والتجارية','معهد الخاص الدولي للتكنولوجيا','الجامعة الخاصة للجنوب','المعهد العالي الخاص لعلوم التمريض بالقيروان','الجامعة التكنولوجية الخاصة تقابس','المدرسة المركزية للقانون والادارة','المدرسة المركزية الخاصة للآداب والقنون والعلوم والاتصالات','المدرسة المركزية للعلوم الطبية والصحية','مدرسة البوليتكنيك المركزية الخاصة بتونس','مدرسة البوليتكنيك الدولية الخاصة بتونس','المدرسة الخاصة لتكنولوجيات المعلومات والتصرف في المؤسسات','كلية الدرسات العليا للسمعي والبصري والتصميم','المدرسة العليا الخاصة لاداراة الأعمال والقانون','المدرسة العليا الخاصة للتنظيم والادارة','المدرسة العليا الخاصة للهندسة والتكنولوجيا','المدرسة العليا الخاصة للتكنولوجيا والادارة','المعهد الخاص للدراسات العليا في تونس','المعهد العالي الخاص لعلوم التمريض الامد','المعهدالعالي الخاص لعلوم التمريض نجمة التكوين','المعهد العالي الخاص للعلوم الشبة طبية محمد الماطري','معهد تونس دوفين','الجامعة العربية الخاصة للعلوم','الجامعة المركزية الخاصة','الجامعة الدولية الخاصة للصحة','الجامعة الدولية الخاصة بتونس','جامعة البحر الأبيض المتوسط الخاصة بتونس','جامعة تونس الحرة','الجامعة الخاصة في مونبليزير']
                },{
                    'name':'Lebannon',
                    'country':'لبنان',
                    'id':961,
                    'citys':['بيروت','القبيات ','شيخ محمد','طرابلس','الهرمل','أنفه','عرسال','دير القمر','جبيل','جونيه','بعلبك','كوك نوح','عاليه','برج','صيدا','صور','حمانا','شتورة','رياق'],
                    'school':['الجامعة اللبنانية‎‎','الجامعة الأميركية في بيروت','جامعة الحكمة','جامعة القديس يوسف','الجامعة اللبنانية الأمريكية','الأكاديمية اللبنانية للفنون الجميلة‎‎','جامعة الشرق الاوسط‎‎','جامعة الروح القدس - الكسليك','جامعة هايكازيان‎‎','جامعة هاواي','جامعة هونولولو','جـامعة بيروت العربية‎‎','المعهد العالي للعلوم الاقتصادية والتطبيقية','جامعة بيروت الاسلامية','جامعة سي اند أي الاميركية ','الكلية الجامعية للتجارة والكمبيوتر','جامعة المقصد الخيرية الاسلامية في بيروت','جامعة طرابلس لبنان','جامعة سيدة اللويزة‎‎','جامعة الجنان','كلية جويا الجامعية للتكنولوجيا ','جامعة البلمند‎‎','جامعة المنار في طرابلس‎‎','الجامعة العالمية ','الجامعة الأميركية للعلوم والتكنولوجيا‎‎','المعهد العالي للتجارة','الجامعـــة الأنطونيـــة','الجامعة الإسلامية في لبنان','كلية لبنان الجامعية للتكنلوجيا ','جامعة الكفاءات‎‎','جامعة رفيق الحريرى','جامعة الحريري الكندية','جامعة التكنولوجيا والعلوم التطبيقية اللبنانية-الفرنسية','الجامعة الحديثة للإدارة والعلوم','جامعة العائلة المقدسة-البترون','الجامعة اللبنانية الدولية‎‎','الجامعة العربية المفتوحة','الجامعة اللبنانية الكندية','جامعة الحريري الكندية','جامعة المعارف','جامعة فينيسيا','كلية جويا الجامعية للتكنولوجيا ','المعهد العالي للأعمال','كلية صيدون الجامعية','معهد لاهوت الشرق الادنى في بيروت']
                },{
                    'name':'Jordan',
                    'country':'الاردان',
                    'id':962,
                    'citys':['اريد','المفرق','الزرقاء','السلط','عمان','مادبا','الكرك','الطفيلة','الشويك','المدبرج','الجفر','معان'],
                    'school':['الجامعة الأردنية','جامعة العلوم التطبيفية','الجامعة الألمانية الأردنية','جامعة الاسراء','جامعة الأميرة سمية للتكنولوجيا','جامعة البتراء','جامعة الزيتونة الأردنية','جامعة نيويورك','جامعة العلوم الاسلامية العالمية','جامعة الشرق الأوسط','جامعة عمان العربية للدراسات العليا الخاصة','جامعة اربد','جامعة العلوم والتكنولوجيا الأردنية','جامعة اربد الأهلية','جامعة جدارا','جامعات المفرق','جامعة آل البيت','جامعة جرش','جامعة فيلادلفيا','جامعة جرش الآهلية','جامعات عجلون','جامعة عجلون الوطنية','جامعات الزرقاء','الجامعة الزرقاء الأهلية','جامعات البلقاء','جامعاة البلقاء التطبيقية','جامعة عمان الأهلية','جامعات مادبا','الجامعة الأمريكية في مادبا','جامعات الكرك','جامعة مؤتة','جامعات معان','جامعة الحسين بن كلال','جامعات الطفيلة','جامعة الكفيلة التقنية','حامعات العقبة','الجامعة الأردنية','الأكاديمية الأردنية للموسيقي','جامعاة عمان العربية للدراسات العليا الخاصة','كلية الأردن الجامعية للتعليم الفندقي','الجامعة العربية المفتوحة','معهد الاعلام الأردني']
                },{
                    'name':'Algeria',
                    'country':'الجزائر',
                    'id':213,
                    'citys':['وهران','سيدي بلعياس','سعيدة','المشرية','النعامة','عين الصفراء','البيض','تيارت','عين وسارة','الجلفة','الأغواط','القرارة','غرداية','الغرارة','عين وسارة','بوسعادة','بيسكرة','المسيلة','الدار البيضاء','برج بوعريريج','بشار','الفنادسة','العبادلة','تاغيت','افلي','بني عياس','الوطي','نندوف','ام العسل','ادلس','الجزائر','عين غاز','أولف','سالي','تيزي وزو','بجاية','سطيف','جيجل','باتنة','بسكرة','تقرت','الوادي','قمار','سكيكدة','قسنطينة','قالمة','حنشلة','تبسة','سوق','أهراس','عنابة','القالة','اليزي ','برج الجواس','جانت','عين فزام'],
                    'school':['جامعة أدرار','جامعة حسيبة بن بوعلي','جامعة عمار ثليجي','جامعة العربي بن مهيدي','جامعة باتنة','جامعة باتنة اثنين','جامعة بجاية','جامعة بسكرة','جامعة محمد طاهري','جامعة البليدة','جامعة لونيسي علي - البليدة2','جامعة محند والحاج','جامعة تمنراست','جامعة العربي التبسي','جامعة أبي بكر بلقايد','جامعة مولود معمري - تيزي وزو‎‎','جامعة الجزائر 1','جامعة الجزائر 2','جامعة الجزائر 3','جامعة العلوم والتكنولوجيا هواري بومدين‎‎','المدرسة الوطنية العليا للبيطري','المدرسة الوطنية العليا للفلاحة','المدرسة الوطنية للإدارة','المدرسة الوطنية المتعددة التقنيات بالجزائر','المدرسة الوطنية التحضيرية لدراسات مهندس','المجلس الأعلى للغة العربية بالجزائر','كلية العلوم الإسلامية في الجزائر','المعهد الوطني للعلوم الفلاحية','المعهد الوطني الجزائري للبحث الزراعي','المعهد الوطني للبريد وتكنولوجيات الإعلام والاتصال','المدرسة الوطنية العليا للإعلام الآلي','المدرسة الوطنية للأشغال العمومية','المدرسة المتعددة التقنيات للهندسة المعمارية والعمران','جامعة العلوم والتكنولوجيا هواري بومدين','المدرسة الوطنية العليا للاحصاء و الاقتصاد التطبيقي الجزائر','المعهد العالي للتسيير والتخطيط','المعهد الوطني للفنون الدرامية','مركز البحث في علم الفلك والفيزياء الفلكية والجيوفيزياء','الوكالة الفضائية الجزائرية','الديوان الوطني للإحصائيات (الجزائر)','المعهد الوطني للأبحاث الغابية','مركز التنوع البيئي بالرغاية','مركز التنوع البيئي بزرالدة','المركز الوطني لختم الطيور','محطة الأبحاث الغابية ببراقي','جامعة زيان عاشور','جامعة جيجل','جامعة فرحات عباس','جامعة محمد لمين دباغين','جامعة حمودة بن ساعي','جامعة سعيدة','جامعة جيلالي اليابس','المدرسة العليا للاعلام الالي - سيدي بلعباس','جامعة باجي مختار','جامعة باجي مختار, عنابة','جامعة قسنطينة','جامعة قسنطينة 3','جامعة الأمير عبد القادر للعلوم الإسلامية ','كلية الطب بقسنطينة','جامعة زرزارة','كلية علوم البيطرة بالخروب','جامعة الدكتور يحيى فارس','جامعة مستغانم','جامعة محمد بوضياف','جامعة معسكر','جامعة قاصدي مرباح','جامعة وهران‎‎','جامعة وهران 2','جامعة العلوم والتكنولوجيا محمد بوضياف','المدرسة الوطنية متعددة التقنيات بوهران','المركز الوطني للبحث في الأنثروبولوجيا الاجتماعية والثقافية','معهد البيتروكيمياويات','معهد الأرصاد الجوي','معهد اللغات','معهد الحضارة الإسلامية','معهد العلوم الإنسانية','مجمع الدكتور سليم طالب','مستشفى وهران الجامعي‎‎','المركز الجامعي البيض','المركز الجامعي إليزي','المركز الجامعي برج بوعريريج','جامعة امحمد بوڤرة بومرداس','المعهد الوطني للهندسة الميكانيكية','المعهد الجزائري للبترول‎‎','جامعة الطارف','المركز الجامعي تندوف','المركز الجامعي تيسمسيلت','جامعة الوادي','جامعة خنشلة','جامعة سوق أهراس - محمد الشريف مساعدية','المركز الجامعي تيبازة','المركز الجامعي لميلة','المركز الجامعي خميس مليانة','المركز الجامعي النعامة','المركز الجامعي عين تموشنت','جامعة غرداية','المركز الجامعي لغليزان']
                },{
                    'name':'Saudi',
                    'country':'السعودية',
                    'id':966,
                    'citys':['طريف','حزم الجلاميد','عرعر','العويفيلة','صوير','سكاكا','تيماء','دفحاء','تيوك','ضبا','الوجه','العلا','تنماء','الغيص','العشاش','خبير','أسيطر','الشملي','الحائط','الروضة الغرالة','حائل','الفاعد','بقعاء','المياه','عفلة الصفور','لينه','فيه','بريدة','المدينة المنورة','بدر','رابع','أبيار علي ','الرس','بريدة','عنيزة','الزلفي','الغاط','المجمعة','شغراء','الدوادمي','عفيف','الرين','الرياض','الحرج','حفر الباطن','الجبيل','الدمام','الخبر','الهفوف','الرين','ليلي','الافلاج','الشلفا','السليل','الباحة','رنية','خميس مشيط','أبها','جازان','نجران','شرورة','الشلفا'],
                    'school':['جامعة أم القري','الجامعة الاسلامية','جامعة الامام محمد بن سعود الاسلامية','جامعة الملك عبد  العزيز','جامعة الملك سعود','جامعة الملك فهد للبترول والمعادن','جامعة نايف العربية للعوم الأمنية','جامعة الملك فيصل','جامعة الملك خالد','جامعة القصيم','جامعة طيبة','جامعة الطانف','جامعة حائل','جامعة جازان','جامعة الجوف','جامعة الباحة','جامعة تبوك','جامعة نجران','جامعة الحدود الشمالية','جامعة الأميرة لورة بنت عبد الرحمن','جامعة الملك سعود بن عبد العزيز للعلوم الصحية','جامعة الدمام','جامعة الملك عبد الله للعلوم والتقنية','جامعة الأمير سطام بن العزيز','جامعة شقراء','الجامعة السعودية الالكترونية','جامعة السعودية الالكترونية','جامعة جدة','جامعة بيشة','جامعة حقر الباطن','جامعة دار العلوم','جامعة الأمير سلطان','جامعة عفت الأهلية','جامعة دار الحكمة','الجامعة العربية المفتوحة','جامعة اليمامة','جامعة الأمير فهد بن سلطان','جامعة الأمير محمد بن فهد','جامعة الفيصل','كلية الملك عبد العزيز الحربية','كلية الملك فهد الأمنية','كلية الملك فيصل الجوية','كلية الملك خالد العسكرية','كلية الملك فهد البحرية','كلية الملك عبد الله للدفاع الجوي','مركز ومدرسة قوة الصواريخ الاستراتيجية']
                },{
                    'name':'Kuwait',
                    'country':'الكويت',
                    'id':965,
                    'citys':['العبدلي','اسطبلات الجهراء','الجهراء','المدينة الكويت','الصليبيخات','الأندلس','بيان','الأحمدي','الفحيحيل','علي صباح السالم','صبحا الأحمد','الخيران','الوفرة'],
                    'school':['جامعة جابر الأحمد','جامعة الكويت','الجامعة الأمريكية في الكويت','الهيئة العامة للتعليم التطبيقي والتدريب','كلية الكويت للعلوم و التكنولوجيا (جامعة)','كلية الكونجوين','الكلية الأسترالية في الكويت','جامعة الخليج للعلوم والتكنولوجيا','الجامعة العربية المفتوحة - الكويت','كلية ماسترخت لإدارة الأعمال','كلية الشرق الأوسط الأمريكية','كلية بوكس هل - للبنات - الكويت','كلية الكويت للتقنية','جامعة الشرق الأوسط الأمريكية','كلية تكنولوجيا الطيران','مدينة صباح السالم الجامعية']
                },{
                    'name':'Iraq',
                    'country':'العراق',
                    'id':964,
                    'citys':['دهوك','زاخو','ناكري','سوران','رانيه','كوئسنجق','اربيل','فلف','الموصل','نلعفر','مخمور','السليمانية','حمجمال','كركوك','تلعفر','شنغال','عين فتي','وردية','البادي','حلبجة','جمجاك','كلار','طوز خورما','تكريت','سامراء','بلد','بعقوبة','جلولة','خنافين','مغدادية','مندلي','حسسينية','بغداد','الرمادي','المحمودية','عزيزية','جصان','النعمانية','كوت','كريلاء','حله','الديوانية','نجف أشرف','العمارة','الشطرة','السماوة','الخضر','ناصرية','سوف الشيوخ','الغرنة','الشافي','بصرة','الزبير','فاو','ام قصر','كربل','القائم'],
                    'school':['جامعة بغداد','الجامعة المستنصرية','جامعة البصرة','جامعة الموصل','الجامعة التكنولوجية','جامعة الكوفة','جامعة تكريت','جامعة القادسية','جامعة الأنبار','الجامعة العراقية','جامعة بابل','جامعة النهرين','جامعة ديالى','جامعة كربلاء','جامعة كركوك','جامعة واسط','جامعة ميسان','جامعة المثنى','جامعة سامراء','جامعة سومر','جامعة القاسم الخضراء','جامعة الفلوجة','جامعة جابر بن حيان الطبية','جامعة البصرة للنفط والغاز','جامعة الكرخ للعلوم','جامعة تكنولوجيا المعلومات والاتصالات','جامعة بغداد للبنات','جامعة نينوى','جامعة الحمدانية','جامعة تلعفر','الجامعة التقنية الوسطى','الجامعة التقنية الجنوبية','الجامعة التقنية الشمالية','جامعة الفرات الأوسط التقنية','جامعة ابن سينا للعلوم الطبية والصيدلانية']
                },{
                    'name':'Palestine',
                    'country':'فلسطين',
                    'id':970,
                    'citys':['ياف','حيقا','مدينة',' غزة','بئر السبع','مدينة الخليل','الداصرة','لابلس','اسدود','ريشون لكسيون','رام الله'],
                    'school':['الجامعة الإسلامية','أكاديمية فلسطين للعلوم الأمنية','جامعة الأزهر بغزة','أكاديمية الإدارة والسياسة','الكلية الجامعية للعلوم التطبيقية','الكلية الجامعية للعلوم والتكنولوجيا','كلية فلسطين التقنية - دير البلح','جامعة غزة','جامعة الأقصى','جامعة القدس المفتوحة','كلية دار الدعوة والعلوم الإنسانية','كلية العودة الجامعية','جامعة النجاح الوطنية','جامعة بيرزيت','جامعة الخليل','جامعة القدس','جامعة بوليتكنك فلسطين','الجامعة العربية الأمريكية - جنين','جامعة بيت لحم','الكلية الإبراهيمية بالقدس','جامعة القدس المفتوحة','جامعة فلسطين التقنية - خضوري','كلية فلسطين الأهلية الجامعية','الكلية العصرية','كلية بيت لحم للكتاب المقدس','كلية دار الكلمة الجامعية للفنون والثقافة','كلية ابن سينا للعلوم الصحية','كلية وجدي نهاد أبو غربية الجامعية التكنولوجية','كلية فلسطين التقنية - العروب','معهد الابحاث التطبيقية في القدس','معهد الصحة والتنمية والإعلام والسياسة ، رام الله','الشبكة الأكاديمية الفلسطينية (بال نت)، تتبع جامعة القدس','معهد إدوارد سعيد الوطني للموسيقى','الجمعية الفلسطينية الأكاديمية للشؤون الدولية، القدس','وزارة التربية والتعليم العالي - فلسطين','معهد لفهم الشرق الأوسط']
                },{
                    'name':'Sudan',
                    'country':'السودان',
                    'id':249,
                    'citys':['وادي حلفا','عبري','واوا','دلقو','دنقلا','الكوة','كورني','ابو حمد','الياوقة','عطبرة','الدامر','شمدي','أم درمان','أميدة','الخرطوم','الجنينة','كنم','الفاشر','نيال','فريضه','الضعين','النهود','أبو زبد','الدلنج','الأبيض','بارا','ربك','سنار','القضارف','الشواك','كسلا ','بورتسودان','سواكن','نفقا','همشكوريب'],
                    'school':['جامعة الأحفاد','جامعة الفاشر','جامعة النيلين','جامعة الزعيم الأزهري','جامعة المشرق','جامعة النيل الأزرق','جامعة بحري','جامعة البطانة','جامعة السلام','جامعة الدلنج','جامعة الإمام المهدي','جامعة المستقبل','جامعة أفريقيا العالمية','جامعة كرري','جامعة السودان العالمية','جامعة الرباط الوطني','جامعة وادي النيل','جامعة أم درمان الأهلية','جامعة أم درمان الإسلامية','جامعة السودان المفتوحة','جامعة البحر الأحمر','جامعة السودان للعلوم والتكنولوجيا','جامعة بخت الرضا','جامعة دنقلا','جامعة القضارف','جامعة المغتربين','جامعة الجزيرة','جامعة كسلا','جامعة ود مدني الاهلية','جامعة الخرطوم','جامعة كردفان','جامعة العلوم الطبية والتكنولوجيا','جامعة نيالا','جامعة العلوم والتقانة','جامعة سنار','جامعة شندي','جامعة القرآن الكريم والعلوم الإسلامية','جامعة زالنجي','جركردفان']
                },{
                    'name':'Yemen',
                    'country':'اليمن',
                    'id':967,
                    'citys':['صعدة','الحزم','خمر','برافش','حجة','عمران','مديرة الخبت','صنعاء','مارب','صرواح','الحديدة','الجبس','ذمار','زبيد','يريم','اب','مديرية التعزية','التربة','الراهجة','لخج','عدن','زنجبار','جعار','الحبيلين','البيضاء','شفرة','اخور','عنق','حبان','الهويمي','بلحاف','بئر علي','السفال','بضه','المكلا','الشخر','الحامي','سيئون','القطن','شام','نريم','قصيعر','سيحون','فشن','حصوين','نشتن','القضة','خوف','ثمود','نريم','شبام','الفطن'],
                    'school':['جامعة صنعاء','جامعة الحديدة','جامعة تعز','جامعة حضرموت','جامعة ذمار','جامعة اب','جامعة عدن','جامعة الاتحاد للعلوم والتكنولوجيا',' الجامعة اليمنية الاردنية','الجامعة البريطانية في اليمن','جامعة الناصر','جامعة الاندلس','جامعة الملكة أروي','جامعة الايمان','الجامعة الوطنية','جامعة الأحقاف','جامعة سيأ','جامعة العلوم والتكنولوجيا','الجامعة اللبنائية الدولية','جامعة المستقبل']
                },{
                    'name':'Syria',
                    'country':'سوريا',
                    'id':963,
                    'citys':['الحسكة','ديرالزور','المبادين','عين عيسي','الرقة','عين العرب',' عيسيعين','منبج','الباب','حلب','السفيرة','ادلب','السخنة','اراك','ندمر','جسر الشغور','اللاذقية','جبلة',' مصاف','طرطوس','سلمية','حمص','الفصير','البنك','يبرود','دمشق','داريا','السويداء','درعا'],
                    'school':['جامعة دمشق','جامعة حلب','الجامعة الافتراضية السورية','جامعة تشرين','جامعة الرشيد الدولية الخاصة للعلوم والتكنولوجيا','الجامعة السورية الخاصة','الجامعة العربية الدولية','الجامعة الدولية للعلوم والتكنولوجيا','جامعة البعث','جامعة الفرات','جامعة القلمون','جامعة اليرموك الخاصة','جامعة الودي الدولية','الجامعة الوطنية الخاصة','الاكاديمية العربية للعلوم والتكنولوجيا والنقل البحري','جامعة الخليج','جامعة ايبلا الخاصة','جامعة المأمون الخاصة للعلوم والتكنولوجيا','جامعة الاتحاد الخاصة','جامعة الجزيرة']
                },{
                    'name':'UAE',
                    'country':'الامارات',
                    'id':971,
                    'citys':['شعم','رأس الخيمة','خت','أم القيوين','عجمان','خورفكان','الفجيرة','كلياء','دبي','العين','ابوظبي','أبو الابيض','المرفا','مدينة زايد','جزرية صبر بني باس'],
                    'school':['جامعة أبو ظبي','جامعة الامارات العربية المتحدة','جامعة الحصن','جامعة خليفة للعلوم والتكنولوجيا والبحوث','جامعة محمد الخامس-أكدال','جامعة زايد','جامعة العين للعلوم والتكنولوجيا','جامعة نيويورك أبوظبي','كلية الامارات للتطوير التربوي','كلية التقنية العليا','كلية فاطمة للعلوم الصحة','المعهد البترولي','معهد مصدر للعلوم والتكنولوجيا','معهد نيويورك للتقنية','جامعة زايد','كلية الامارات الادارة وتكنولوجيا المعلومات','كليات التقنية العليا','كلية دبي الجامعية للدراسات   التطبيقية','جامعة الشهيد بهشتي في دبي','جامعة الغرير','الجامعة الأمريكية في دبي','الجامعة البريطانية في دبي','جامعة جميرا','الجامعة الكندية دبي','كلية دبي الجامعية','كلية دبي الطبية','كلية دبي للادارة الحكومية','جامعة دبي','أكاديمية الامارات لادارة الضيافة','كلية الامارات للطيران','جامعة حمدان بن محمد الالكترونية','جامعة الشارقة','الجامعة الامريكية في الشارقة','جامعة  عجمان','جامعة العين','جامعة العلوم الابداعية','كلية الفجيرة']
                },{
                    'name':'Quatra',
                    'country':'قطر',
                    'id':974,
                    'citys':['الغويربة','الخور','الجميلية','لوسيل','دخان ','الدوحة','الوكرة','الريان','أمباب','الكرعانة','مسيعيد'],
                    'school':['جامعة قطر','جامعة حمد بن خليفة','برنانج الجسر الأكاديمي','جامعة تكساس أي أند ام في قطر','جامعة جورجتاون في قطر','جامعة كارنيجي ميلون في قطر','جامعة كالجاري قطر','كلية باريس للدراسات التجارية العليا','كلية شمال الاطلنطي في قطر','كلية لندن الجامعية قطر']
                },{
                    'name':'Barlin',
                    'country':'بحرين',
                    'id':973,
                    'citys':['المحرق','المنامة','الحد','فلالي','مدينة عيسي','سترة','الرفاع','كرزكان','عوالي','صدد','الزلاق','جو'],
                    'school':['جامعة الخليج العربي','كلية العلوم الصحية','جامعة البحرين','بوليتكنك البحرين','الجامعة الأهلية','جامعة أما الدولية البحرين','جامعة العلوم التطبيقية','الجامعة العربية المفتوحة','معهد البحرين للتكنولوجيا','معهد البحرين للدراسات المصرفية والمالية','جامعة بنتلي','معهد بيرلا للتكنولوجيا والمركزالدولي','جامعة دلمون للعلوم والتكنولوجيا','جامعة ديبول','الجامعة الخليجية','معهد نيويورك للتكنولوجيا','الجامعة الطبية بالبحرين','الجامعة الملكية للمرأة','جامعة المملكة','كلية البحرين الجامعية','الجامعة الأوروبية','الكلية الملكية للجراحين في ايرلندا']
                },{
                    'name':'Oman',
                    'country':'عمان',
                    'id':968,
                    'citys':['ولاية شناص','لوي','ولاية محضة','ولاية صحار','المغر','ولاية صحم','حفيبت','ولاية ضنك','ولاية ينقل','ولاية ضك','ولاية السويق','ولاية عبري','العين','ولاية الرسناق','ولاية بركاء','العوابي','الحمراء','ولاية نزي','بهلاء','أزكي','ولاية منح','سمائل','فنجا','السيب','مسقط','قريات','ضباب','طوي','فلهات','الفابل','ابراء','سناو','ازكي','طيوي','ولاية نزوي','ادم','صور','الاشخرة','ثمريت','مرياط','صلالة','حار'],
                    'school':['جامعة السلطان فابوس','الجامعة العربية المفتوحة','جامعة ظفار','جامعة صحراء','جامعة الشرقية','جامعة نزوي','الجامعة الالمانية للتكنولوجيا في عمان','جامعة البريمي','كليات العلوم التطبيفية','الكلية التفنية العليا','الكليات النفنية','كلية الحرس السلطاني العماني النقنية','كلية الدراسات المصرفية والمالية','كلية البريمي الجامعة','كلية عمان البحرية الدولية','كلية الخليج','الكلية الدولية للهندسة والادارة','كلية الشرق الاوسط','الكلية العلمية للتصميم','كلية عمان للادارة والتكتولوجيا','كلية عمان الطبية','كلية مجان','كلية مسقط','كلية ولجات للعلوم التطبيقية','كلية كالدونيان الهندسية','كلية صور الجامعية','كلية مزون','الكلية الحديثة للتجارة والعلوم','كلية البيان','كلية عمان للسياحة','كلية عمان لطب الأسذان','كلية الزهراء للبنات','الكلية العالمية للهندسة والتكنولوجيا']
                },{
                    'name':'Mauritania',
                    'country':'موريتانيا',
                    'id':222,
                    'citys':['عين بنتيلي','بير مغرين','الزويران','أفديرك','وادان','شنقيط','أطار','نحكحة','نواديبو','أكجوجت','نواكشوط','بوتلميت','الاك','مال','يوكي','كهدي','سبلبابي','كرز كبفه','العيون','تنبدغة','ولانة','النعمة','بوكادوم','عدل بكرو'],
                    'school':['المعهد العالي للدراسات والبحوث الاسلامية','جامعة العلوم الاسلامية بلعيون','جامعة عبد الله بن ياسين','جامعة نواكشوط']
                },{
                    'name':'Somalia',
                    'country':'الصومال',
                    'id':252,
                    'citys':['هرجيسا','بربرة','برعو','هيلان','بوساسو','قرضو','غاروي','لاسعانود','جالكابو','بانديرادلي','هبيا','بلد وين','مدينة فرلياح','بولوبورني','واجيد','بيدوة','بورجك','عضلة','مقديشو','مركا','لوك','غاربهارأي','بارديرا','ساكوو','حرمك','جيليب','افمادوو','جمامي'],
                    'school':['جامعة مقديسو','جامعة هرجيسيا','جامعة بنادر','جامعة جزيرة']
                },{
                    'name':'Djibouti',
                    'country':'جيبوتي',
                    'id':253,
                    'citys':['مول هوله','علابلي دادا','أوبوك','تاجورة','جيبوتي','لويادا','علي صابح'],
                    'school':[]
                },{
                    'name':'Libya',
                    'country':'ليبيا',
                    'id':218,
                    'citys':['أبو كماش','زوارة','تيجي','نالوت','الجوش','الونتان','غريان','طرابلس','تاجوراء','مسلانة','مصراتة','زليتن','ناورغاء','أبوفرين','سرت','السيدر','رأس لانوف','ودان','الفقهاء','زلة','مردة','زالطن','جالو أوجلة','سلوق','الأبيا','بنغازي','المرج','البيضاء','شحات ','الفبة','درنة','طبرق','بردبة','الحغبوب','الجوف','براك','أدري','تمسان','سمنو','يستها','تمسة','زويلة','تراغن','مرزق','جرمة','القطرون','العويناث','غات'],
                    'school':[]
                },{
                    'name':'Comorin',
                    'country':'جزر القمر',
                    'id':269,
                    'citys':['موروني','فومبوني','موهبلي','هاجوهو','موسامودو','بازيميني','بيمبيني','لينكوني','دوموني'],
                    'school':[]
                }];

            window['LocalStroge']=LocalStroge={
                'Set_Stroge':function(name,value){
                    localStorage.setItem(name,value);
                },
                'Get_Stroge':function(name){
                    return localStorage.getItem(name);
                }
            };

            //localStorage
            var u_name=LocalStroge.Get_Stroge('user_name'),
                u_sex=LocalStroge.Get_Stroge('u_sex'),
                s_country=LocalStroge.Get_Stroge('Select_Country'),
                s_city=LocalStroge.Get_Stroge('Select_City'),
                s_school=LocalStroge.Get_Stroge('Select_Schoole'),
                c_num=LocalStroge.Get_Stroge('country_num'),
                what_num=LocalStroge.Get_Stroge('whatsapp_num'),
                f_book=LocalStroge.Get_Stroge('FaceBook'),
                Singing=LocalStroge.Get_Stroge('Singing'),
                Dance=LocalStroge.Get_Stroge('Dance'),
                Acting=LocalStroge.Get_Stroge('Acting'),
                Other=LocalStroge.Get_Stroge('Other'),
                view1=LocalStroge.Get_Stroge('view1'),
                view2=LocalStroge.Get_Stroge('view2'),
                hasJoined=window['LocalStroge'].Get_Stroge('joinId');

            if(hasJoined){
                $('.already_reg').removeClass('hidden');
                $('.success_Tips').removeClass('hidden');
            }


            jQuery('#user_name').val(u_name);
            jQuery('#'+u_sex).attr('checked',true);
            jQuery('#Select_Country').val(s_country);
            jQuery('#Select_City').val(s_city);
            jQuery('#Select_Schoole').val(s_school);
            jQuery('.country_num').val(c_num);
            jQuery('.whatsapp_num').val(what_num);
            jQuery('#FaceBook').val(f_book);
            jQuery('#'+Singing).addClass('Selected');
            jQuery('#'+Dance).addClass('Selected');
            jQuery('#'+Acting).addClass('Selected');
            jQuery('#'+Other).addClass('Selected');
            jQuery('#view1').attr('src',view1);
            jQuery('#view2').attr('src',view2);


            //填充3个select
            var country_list='';
            Country_City_School.map(function(data,index) {
                var city_list='',school_list='',country_num,country_name,country_name_en,city_lists,school_lists;
                city_lists=data.citys;
                school_lists=data.school;
                country_num=data.id;
                country_name=data.country;
                country_name_en=data.name;
                country_list='<span class="country_name" coun_name="'+country_name_en+'">'+country_name+'</span>';
                city_list+='<div class="citys" c_num="'+index+'">';
                city_list+='<span class="country_name" id="'+country_num+'">'+country_name+'</span>';
                city_list+='<div class="city_list">';
                school_list+='<div class="school" s_num="'+index+'">';
                school_list+='<span class="country_name">'+country_name+'</span>';
                school_list+='<div class="school_list">';
                jQuery('#Country_List').append(country_list);
                city_lists.map(function(city,ind){
                    city_list+='<span class="city1">'+city+'</span>'
                });
                city_list+='</div>';
                city_list+='</div>';
                jQuery("#City_List").append(city_list);
                school_lists.map(function(school,ind){
                    school_list+='<span class="school1">'+school+'</span>';
                });
                school_list+='</div>';
                school_list+='</div>';
                jQuery('#School_List').append(school_list);
            });

            //3个select的事件
            jQuery('#Select_City,#Select_Country,#Select_Schoole').bind('click',function(){
                jQuery('#Country_All,#Citys_All,#School_All').addClass('hidden');
                jQuery(this).next().removeClass('hidden');
            });
            jQuery('.back_btn').bind('click',function(){
                jQuery(this).parent().parent().addClass('hidden')
            });


            //一些交互事件
            //选择国家
            jQuery('#Country_List .country_name').bind('click',function(){
                var country_name=jQuery(this).text();
                jQuery('#Select_Country').val(country_name);
                LocalStroge.Set_Stroge('Select_Country',country_name);
                jQuery('#Country_All').addClass('hidden');
                jQuery('#Select_Country').removeClass('errorTips');
                jQuery('.Country').addClass('Right_Tips');
            });

            //选择城市
            jQuery(".citys .country_name").bind("click",function() {
                var country_num=jQuery(this).attr('id');
                var ind=jQuery(this).parent('.citys').attr("c_num");
                ind=parseInt(ind);
                jQuery(this).parents('#City_List').animate({scrollTop:ind*71});
                var that = this;
                jQuery(".Whatsapp input").eq(0).val(country_num);
                jQuery('.country_name').removeClass('select_up');
                jQuery('.city_list').stop().slideUp();
                jQuery(this).addClass('select_up');
                jQuery(this).next('.city_list').stop().slideDown();
                jQuery(this).next('.city_list').children('span').bind("click", function () {
                    var city=jQuery(this).text();
                    jQuery('.city_list span').removeClass('selected_c');
                    jQuery(this).addClass('selected_c');
                    jQuery('#Select_City').val(city);
                    LocalStroge.Set_Stroge('Select_City',city);
                    jQuery('#Citys_All').addClass('hidden');
                    jQuery('.City').addClass('Right_Tips');
                    jQuery('.country_name').removeClass('select_up');
                    jQuery('.school_list').stop().slideUp();
                    jQuery("#Select_Schoole").bind("click",function(){
                        jQuery('#School_List .school').eq(ind).children('.country_name').addClass("select_up");
                        jQuery('#School_List .school').eq(ind).children('.school_list').stop().slideDown();
                        jQuery('#School_List').animate({scrollTop:ind*71});
                        jQuery(".school_list span").bind("click",function(){
                            jQuery('.school_list span').removeClass('selected_c');
                            jQuery(this).addClass('selected_c');
                        })
                    })
                });
                jQuery('.select_up').bind('click',function(){
                    jQuery(this).toggleClass('select_up');
                    jQuery(this).next().stop().slideToggle();
                });
            });

            //选择大学
            jQuery(".school .country_name").bind("click",function() {
                var ind=jQuery(this).parent('.school').attr("s_num");
                ind=parseInt(ind);
                jQuery(this).parents('#School_List').animate({scrollTop:ind*71});
                var that = this;
                jQuery('.country_name').removeClass('select_up');
                jQuery('.school_list').stop().slideUp();
                jQuery(this).addClass('select_up');
                jQuery(this).next('.school_list').stop().slideDown();
                jQuery(this).next('.school_list').children('span').bind("click", function () {
                    var school=jQuery(this).text();
                    jQuery('.school_list span').removeClass('selected_c');
                    jQuery(this).addClass('selected_c');
                    jQuery('#Select_Schoole').val(school);
                    LocalStroge.Set_Stroge('Select_Schoole',school);
                    jQuery('#School_All').addClass('hidden');
                    jQuery('.School').addClass('Right_Tips');
                });
                jQuery('.select_up').bind('click',function(){
                    jQuery(this).toggleClass('select_up');
                    jQuery(this).next().stop().slideToggle();
                });
            });

            jQuery('.school_list').children('span').bind("click", function () {
                var school=jQuery(this).text();
                jQuery('#Select_Schoole').val(school);
                LocalStroge.Set_Stroge('Select_Schoole',school);
                jQuery('#School_All').addClass('hidden');
                jQuery('.School').addClass('Right_Tips');
            });


            //修改国家编号
            jQuery('.country_num').bind('click',function(){
                jQuery(this).val('');
            });
            jQuery('.revise').bind('click',function(){
                jQuery('.already_reg,.success_Tips').addClass('hidden')
            });
            jQuery('.country_num,.whatsapp_num').bind('keyup',function(){
                Whatsapp();
            });
            jQuery('.country_num').bind('click',function(){
                Whatsapp();
            });

            //验证facebook
            jQuery('#FaceBook').bind('keyup',function(){
                var f_b=jQuery('#FaceBook').val();
                f_b=jQuery.trim(f_b);

                if(f_b){
                    if(f_b.match(/\./g) && f_b.match(/Facebook/ig)){
                        jQuery('#FaceBook').removeClass('errorTips');
                        jQuery('.FaceBook').addClass('Right_Tips');
                        LocalStroge.Set_Stroge('FaceBook',f_b);
                    }else{
                        jQuery('.FaceBook').removeClass('Right_Tips');
                        jQuery('#FaceBook').addClass('errorTips');
                    }
                }else{
                    jQuery('#FaceBook').removeClass('errorTips');
                }
            });


            jQuery('.Host_Rules').bind('click',function(){
                jQuery('.Host_Rules_Details').removeClass('hidden')
            });
            jQuery('.Rules_Details_Close a').bind('click',function(){
                jQuery('.Host_Rules_Details').addClass('hidden')
            });
            //验证name
            jQuery('.Name_User input').bind('keyup',function(){
                var reg=/\d/g;
                var val=jQuery(this).val();
                val=jQuery.trim(val);
                val=val.slice(0,50);
                if(val.match(reg) || !val){
                    jQuery(this).parents('.Name_User').removeClass('Right_Tips');
                    jQuery('#user_name').addClass('errorTips');
                }
                else{
                    LocalStroge.Set_Stroge('user_name',val);
                    jQuery('#user_name').removeClass('errorTips');
                    jQuery(this).parents('.Name_User').addClass('Right_Tips');

                }
            });

            jQuery('.Sex_User input').bind('click',function(){
                var sexId=jQuery(this).attr('id');
                LocalStroge.Set_Stroge('u_sex',sexId);
            });

            //whatsapp验证
            jQuery('.whatsapp_num').bind('keyup',function(){
                var reg=/^\d+$/g;
                var val=jQuery(this).val();
                val=jQuery.trim(val);
                val=val.slice(0,20);
                if(!val.match(reg)){
                    jQuery('.Whatsapp').removeClass('Right_Tips');
                    jQuery('.Whatsapp input').addClass('errorTips');
                }
                else{
                    jQuery('.Whatsapp input').removeClass('errorTips');
                    jQuery('.Whatsapp').addClass('Right_Tips');

                }
            });



            //国际编号和whatApp号
            Whatsapp=function(){
                var num=jQuery('.country_num').val(),whatsapps=jQuery('.whatsapp_num').val();
                num=num.slice(0,7);
                whatsapps=whatsapps.slice(0,20);
                jQuery('.country_num').val(num);
                jQuery('.whatsapp_num').val(whatsapps);
                if(num && whatsapps){
                    LocalStroge.Set_Stroge('country_num',num);
                    LocalStroge.Set_Stroge('whatsapp_num',whatsapps);
                    jQuery('.Whatsapp input').removeClass('errorTips');
                    jQuery('.Whatsapp').addClass('Right_Tips');
                }
                else
                    jQuery('.Whatsapp').removeClass('Right_Tips');
            };

            jQuery(".Edit").bind("click",function(){
                jQuery(this).parents(".Sub_Tips").hide();
            });
            var selected;
            jQuery(".Favorite>span").bind("click",function(){
                jQuery(this).toggleClass('Selected');
                selected=jQuery(".Favorite>span.Selected").length;
                if(selected>3){
                    jQuery(this).removeClass('Selected');
                    //LocalStroge.Set_Stroge(intId,'');
                    $('.tips_detail').html(' الرجاء قم بإختيار ثلاث مواهب فقط');
                    SetTime();
                }
                var name=jQuery(this).attr('id'),
                    value=jQuery(this).html();
                if(jQuery(this).attr('class').match(/Selected/g)){
                    LocalStroge.Set_Stroge(name,name);
                }else{
                    LocalStroge.Set_Stroge(name,'');
                }

            });

            SetTime=function(){
                $('.block_tips ').removeClass('hidden');
                setTimeout(function(){
                    jQuery(".block_tips").addClass('hidden');
                    jQuery('.tips_detail').html('');
                },1000);
            };
        },

        'uploadImg':function(){
            //上传、压缩、剪切 base64图片
            var that=this;
            jQuery(".divs input").bind("click",function(){


                var image_type, id=jQuery(this).attr("id");
                var img=jQuery(this).next().attr("id");
                jQuery("#clipArea").photoClip({
                    width: 400,
                    height: 400,
                    file: "#"+id,
                    view: "#"+img,
                    ok: "#clipBtn",
                    loadComplete: function() {
                        jQuery(".screen_blank").show();
                    },
                    loadError:function(event){
                       // console.log(event)
                    },
                    clipFinish:function(ImgType){
                        jQuery(".screen_blank").hide();
                        that.doUploadImg(img,ImgType);
                    }
                });
            });
        },
        'doUploadImg':function(imgId,ImgType){
            var imgName=ImgType.name;
            var imgData=jQuery('#'+imgId).attr('src');
            imgData=imgData.slice(imgData.indexOf(',')+1);
            jQuery('#'+imgId).attr('imgName',imgName);

            Bussiness.postData('service/upload/v3/act',{filename:imgName,file:imgData},function(data){
                if(data['code']==0){
                    jQuery('#'+imgId).attr('src','/resource/'+data['dataInfo']);
                    jQuery('#'+imgId).parents('.divs').find('span').text('تم رفع الصورة بنجاح ').show();
                    window['LocalStroge'].Set_Stroge(imgId,'/resource/'+data['dataInfo']);

                    //alert(imgId+ "---" +'/resource/'+data['dataInfo']);
                }else{
                    jQuery('#'+imgId).attr('src','/resource/static/image/error.jpg');
                    jQuery('#'+imgId).parents('.divs').find('span').text('فشل في التحميل ').show();
                }
            });
        },
        'doJoin':function(){
            var that=this;
            var bConfirm=true;

            //提交报名信息、编辑、确定
            jQuery(".Submit_Info").bind("click",function(){

                var joinId=window['LocalStroge'].Get_Stroge('joinId')?window['LocalStroge'].Get_Stroge('joinId'): 0,
                    type= joinId?2:1,
                    name=jQuery('#user_name').val(),
                    sex=jQuery('input[name=Sex_User]:checked').val(),
                    country =jQuery('.country_num').val(),
                    countryName= jQuery('#Select_Country').val(),
                    cityName=jQuery('#Select_City').val(),
                    universityName=jQuery('#Select_Schoole').val(),
                    phone=jQuery('.whatsapp_num').val(),
                    facebook=jQuery('#FaceBook').val()?jQuery('#FaceBook').val():'',
                    talent=[],
                    sTalent='',
                    picOne=jQuery('#view2').attr('src'),
                    picTwo=jQuery('#view1').attr('src'),
                    picError='/resource/static/image/error.jpg';

                jQuery('.Favorite>span.Selected').each(function(){
                    talent.push(jQuery(this).html());
                });

                sTalent=talent.join(',');


                //验证name-非空
                if(!name || jQuery.trim(name)==''){
                    that.tipsShow(1000,'الرجاء ملء جميع الفراغات');
                    jQuery('#user_name').addClass('errorTips');
                    jQuery("body").animate({scrollTop: jQuery('#user_name').offset().top-10},600);
                    jQuery('#user_name').focus();
                    bConfirm=false;
                    return;
                }else{
                    hostName=jQuery.trim(name);
                    jQuery('#user_name').removeClass('errorTips');
                    bConfirm=true;
                }

                //验证name-格式
                if(name && jQuery.trim(name).match(/\d/g)){
                    that.tipsShow(1000,'الرجاء كتابة الصيغة الصحيحة');
                    jQuery('#user_name').addClass('errorTips');
                    jQuery("body").animate({scrollTop: jQuery('#user_name').offset().top-10},600);
                    jQuery('#user_name').focus();
                    bConfirm=false;
                    return;
                }else{
                    hostName=jQuery.trim(name);
                    jQuery('#user_name').removeClass('errorTips');
                    bConfirm=true;
                }

                //验证sex
                if(!sex){
                    that.tipsShow(1000,'الرجاء ملء جميع الفراغات');
                    jQuery("body").animate({scrollTop: jQuery('.Sex_User').offset().top-10},600);
                    bConfirm=false;
                    return;
                }else{
                    bConfirm=true;
                }

                //验证countryName
                if(!countryName){
                    that.tipsShow(1000,'الرجاء ملء جميع الفراغات');
                    jQuery('#Select_Country').addClass('errorTips');
                    jQuery("body").animate({scrollTop: jQuery('.Country').offset().top-10},600);
                    bConfirm=false;
                    return;
                }else{
                    jQuery('#Select_Country').removeClass('errorTips');
                    bConfirm=true;
                }

                //验证cityName
                if(!cityName){
                    that.tipsShow(1000,'الرجاء ملء جميع الفراغات');
                    jQuery('#Select_City').addClass('errorTips');
                    jQuery("body").animate({scrollTop: jQuery('.City').offset().top-10},600);
                    bConfirm=false;
                    return;
                }else{
                    jQuery('#Select_City').removeClass('errorTips');
                    bConfirm=true;
                }

                //验证universityName
                if(!universityName){
                    that.tipsShow(1000,'الرجاء ملء جميع الفراغات');
                    jQuery('#Select_Schoole').addClass('errorTips');
                    jQuery("body").animate({scrollTop: jQuery('.School').offset().top-10},600);
                    bConfirm=false;
                    return;
                }else{
                    jQuery('#Select_Schoole').removeClass('errorTips');
                    bConfirm=true;
                }



                //验证countryNum
                if(!country){
                    that.tipsShow(1000,'الرجاء ملء جميع الفراغات');
                    jQuery('.Whatsapp input').addClass('errorTips');
                    jQuery("body").animate({scrollTop: jQuery('.Whatsapp').offset().top-10},600);
                    bConfirm=false;
                    return;
                }else{
                    jQuery('.Whatsapp input').removeClass('errorTips');
                    bConfirm=true;
                }

                //验证whatsapp_num-非空
                if(!phone){
                    that.tipsShow(1000,'الرجاء ملء جميع الفراغات');
                    jQuery('.Whatsapp input').addClass('errorTips');
                    jQuery("body").animate({scrollTop: jQuery('.Whatsapp').offset().top-10},600);
                    bConfirm=false;
                    return;
                }else{
                    jQuery('.Whatsapp input').removeClass('errorTips');
                    bConfirm=true;
                }


                //验证whatsapp_num-格式
                if(phone && !phone.match(/^\d+$/g)){
                    that.tipsShow(1000,'الرجاء كتابة الصيغة الصحيحة');
                    jQuery('.Whatsapp input').addClass('errorTips');
                    jQuery("body").animate({scrollTop: jQuery('.Whatsapp').offset().top-10},600);
                    bConfirm=false;
                    return;
                }else{
                    jQuery('.Whatsapp input').removeClass('errorTips');
                    bConfirm=true;
                }


                //验证facebook
                if(facebook){
                    if(facebook.match(/\./g) && facebook.match(/Facebook/ig)){
                        jQuery('#FaceBook').removeClass('errorTips');
                        bConfirm=true;

                    }else{
                        jQuery("body").animate({scrollTop: jQuery('.FaceBook').offset().top-10},600);
                        that.tipsShow(1000,'الرجاء كتابة الصيغة الصحيحة');
                        jQuery('#FaceBook').addClass('errorTips');
                        bConfirm=false;
                        return false;
                    }
                }


                //验证talent
                if(!sTalent){
                    that.tipsShow(1000,'الرجاء ملء جميع الفراغات');
                    jQuery("body").animate({scrollTop: jQuery('.Favorite').offset().top-10},600);
                    bConfirm=false;
                    return;
                }else{
                    bConfirm=true;
                }


                //验两张图片
                if(!picOne || !picTwo || picOne==picError || picTwo==picError ){
                    //jQuery('.Upload_Photo_Tips').addClass('errorTitle');
                    that.tipsShow(1000,'الرجاء ملء جميع الفراغات');
                    jQuery("body").animate({scrollTop: jQuery('.Upload_Photo').offset().top-10},600);
                    bConfirm=false;
                    return;
                }else{
                    jQuery('.Upload_Photo_Tips').removeClass('errorTitle');
                    bConfirm=true;
                }

                var sUrl='service/activity/v3/15?type='+type+'&joinId='+joinId+'&name='+name+'&sex='+sex+'&country='+country+'&countryName='+countryName+'&cityName='+cityName+'&universityName='+universityName+'&phone='+phone+'&facebook='+facebook+'&talent='+talent+'&picOne='+picOne+'&picTwo='+picTwo;




                console.log(sUrl);
                    sUrl=encodeURI(sUrl);

                if(bConfirm){
                    Bussiness.getData(sUrl,function(data){
                        console.log('报名结果start...');
                        console.log(data);
                        console.log('报名结果 end...');
                        if(data['code']==0){
                            window['LocalStroge'].Set_Stroge('joinId',data['dataInfo']['joinId']);
                            jQuery('.already_reg').removeClass('hidden');
                            jQuery('.success_Tips').removeClass('hidden');
                            jQuery('body,html').animate({scrollTop:0});

                        }else{
                            that.tipsShow(1000,'للأسف حدث فشل في تسليم بياناتك، ممكن تجرب مرة أخرى ؟');
                        }
                    }.bind(this),null,'isV3')
                }

            }.bind(this));

        },
        'tipsShow':function(iTtime,sInfo){
            jQuery('.block_tips').find('.tips_detail').text(sInfo);
            $('.block_tips ').removeClass('hidden');

            setTimeout(function(){
                jQuery('.block_tips').find('.tips_detail').text('')
                jQuery('.block_tips').addClass('hidden');
            },iTtime)

        }
    }
    Page.run();
});

